{
    "id": "9d8a55f8-9ac8-4c10-9c69-93dcbcfb6301",
    "displayName": "Block login attempt from all countries except Europe",
    "createdDateTime": "2025-01-07T09:38:36.113187Z",
    "modifiedDateTime": "2025-01-16T21:09:45.8344928Z",
    "state": "enabled",
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "platforms": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": [],
            "applicationFilter": null
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": {
                "guestOrExternalUserTypes": "serviceProvider",
                "externalTenants": {
                    "@odata.type": "#microsoft.graph.conditionalAccessEnumeratedExternalTenants",
                    "membershipKind": "enumerated",
                    "members": [
                        "a2b18e84-31ca-4329-8784-783976e9373e",
                        "d1b209ea-0ffb-4ffe-b4dd-efac86a80e61"
                    ]
                }
            }
        },
        "locations": {
            "includeLocations": [
                "All"
            ],
            "excludeLocations": [
                "Europa"
            ]
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "block"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#conditionalAccess/policies(\u00279d8a55f8-9ac8-4c10-9c69-93dcbcfb6301\u0027)/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    },
    "LocationInfo": [
        null,
        {
            "@odata.type": "#microsoft.graph.countryNamedLocation",
            "displayName": "Europa",
            "countriesAndRegions": [
                "AT",
                "BE",
                "CY",
                "HR",
                "CZ",
                "DK",
                "EE",
                "FO",
                "FI",
                "FR",
                "DE",
                "GL",
                "IS",
                "HU",
                "IE",
                "IT",
                "XK",
                "LV",
                "LT",
                "ME",
                "MC",
                "NO",
                "PT",
                "PL",
                "RO",
                "SM",
                "RS",
                "SK",
                "SI",
                "ES",
                "SJ",
                "CH",
                "SE",
                "GB"
            ],
            "includeUnknownCountriesAndRegions": false,
            "countryLookupMethod": "clientIpAddress"
        }
    ],
    "@odata.context": "https://graph.microsoft.com/beta/#identity/conditionalAccess/policies/",
    "@odata.type": "#microsoft.graph.conditionalAccessPolicy"
}