{"ETag":"W/\"datetime'2025-04-03T09%3A30%3A16.0467656Z'\"","PartitionKey":"CATemplate","RowKey":"f1d92300-eaf1-4bf1-9be4-5673ccd9d4be","Timestamp":"2025-04-03T09:30:16.0467656+00:00","JSON":"{\"id\":\"9523223e-2a19-4912-8c4a-b577917dd44a\",\"displayName\":\"MFA to join devices with Entra\",\"createdDateTime\":\"2025-01-07T09:38:37.7077442Z\",\"modifiedDateTime\":\"2025-01-07T09:43:39.1188107Z\",\"state\":\"enabled\",\"conditions\":{\"userRiskLevels\":[],\"signInRiskLevels\":[],\"clientAppTypes\":[\"all\"],\"platforms\":null,\"locations\":null,\"times\":null,\"deviceStates\":null,\"devices\":null,\"clientApplications\":null,\"applications\":{\"includeApplications\":[],\"excludeApplications\":[],\"includeUserActions\":[\"urn:user:registerdevice\"],\"includeAuthenticationContextClassReferences\":[],\"applicationFilter\":null},\"users\":{\"includeUsers\":[\"All\"],\"excludeUsers\":[],\"includeGroups\":[],\"excludeGroups\":[],\"includeRoles\":[],\"excludeRoles\":[],\"includeGuestsOrExternalUsers\":null,\"excludeGuestsOrExternalUsers\":{\"guestOrExternalUserTypes\":\"serviceProvider\",\"externalTenants\":{\"@odata.type\":\"#microsoft.graph.conditionalAccessEnumeratedExternalTenants\",\"membershipKind\":\"enumerated\",\"members\":[\"d1b209ea-0ffb-4ffe-b4dd-efac86a80e61\",\"a2b18e84-31ca-4329-8784-783976e9373e\"]}}}},\"grantControls\":{\"operator\":\"OR\",\"builtInControls\":[\"mfa\"],\"customAuthenticationFactors\":[],\"termsOfUse\":[],\"authenticationStrength@odata.context\":\"https://graph.microsoft.com/beta/$metadata#conditionalAccess/policies('9523223e-2a19-4912-8c4a-b577917dd44a')/grantControls/authenticationStrength/$entity\",\"authenticationStrength\":null},\"LocationInfo\":[null,null]}","GUID":"f1d92300-eaf1-4bf1-9be4-5673ccd9d4be"}