{"ETag":"W/\"datetime'2025-04-03T09%3A30%3A16.6809851Z'\"","PartitionKey":"CATemplate","RowKey":"42776e6c-fc04-45ef-a119-4fcef9634ec6","Timestamp":"2025-04-03T09:30:16.6809851+00:00","JSON":"{\"id\":\"94947950-c303-420b-a7ff-70ebca23538a\",\"displayName\":\"Only allow MFA setup and passord reset in Norway\",\"createdDateTime\":\"2025-01-07T09:38:39.2126735Z\",\"modifiedDateTime\":\"2025-01-07T09:44:12.3823283Z\",\"state\":\"enabled\",\"conditions\":{\"userRiskLevels\":[],\"signInRiskLevels\":[],\"clientAppTypes\":[\"all\"],\"platforms\":null,\"times\":null,\"deviceStates\":null,\"devices\":null,\"clientApplications\":null,\"applications\":{\"includeApplications\":[],\"excludeApplications\":[],\"includeUserActions\":[\"urn:user:registersecurityinfo\"],\"includeAuthenticationContextClassReferences\":[],\"applicationFilter\":null},\"users\":{\"includeUsers\":[\"All\"],\"excludeUsers\":[],\"includeGroups\":[],\"excludeGroups\":[],\"includeRoles\":[],\"excludeRoles\":[],\"includeGuestsOrExternalUsers\":null,\"excludeGuestsOrExternalUsers\":{\"guestOrExternalUserTypes\":\"serviceProvider\",\"externalTenants\":{\"@odata.type\":\"#microsoft.graph.conditionalAccessEnumeratedExternalTenants\",\"membershipKind\":\"enumerated\",\"members\":[\"a2b18e84-31ca-4329-8784-783976e9373e\",\"d1b209ea-0ffb-4ffe-b4dd-efac86a80e61\"]}}},\"locations\":{\"includeLocations\":[\"All\"],\"excludeLocations\":[\"Norway\"]}},\"grantControls\":{\"operator\":\"OR\",\"builtInControls\":[\"block\"],\"customAuthenticationFactors\":[],\"termsOfUse\":[],\"authenticationStrength@odata.context\":\"https://graph.microsoft.com/beta/$metadata#conditionalAccess/policies('94947950-c303-420b-a7ff-70ebca23538a')/grantControls/authenticationStrength/$entity\",\"authenticationStrength\":null},\"LocationInfo\":[null,{\"@odata.type\":\"#microsoft.graph.countryNamedLocation\",\"displayName\":\"Norway\",\"countriesAndRegions\":[\"NO\"],\"includeUnknownCountriesAndRegions\":false,\"countryLookupMethod\":\"clientIpAddress\"}]}","GUID":"42776e6c-fc04-45ef-a119-4fcef9634ec6"}