{
    "id": "89165f74-e86d-4cc4-83d9-ffd98a98e0b7",
    "templateId": "c7503427-338e-4c5e-902d-abe252abfb43",
    "displayName": "Require multifactor authentication for admins",
    "createdDateTime": "2025-01-07T09:38:40.160332Z",
    "modifiedDateTime": "2025-01-30T09:42:07.7967905Z",
    "state": "enabled",
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": [],
            "applicationFilter": null
        },
        "users": {
            "includeUsers": [],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": [
                "62e90394-69f5-4237-9190-012177145e10",
                "194ae4cb-b126-40b2-bd5b-6091b380977d",
                "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
                "29232cdf-9323-42fd-ade2-1d097af3e4de",
                "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
                "729827e3-9c14-49f7-bb1b-9608f156bbb8",
                "b0f54661-2d74-4c50-afa3-1ec803f12efe",
                "fe930be7-5e62-47db-91af-98c3a49a38b1",
                "c4e39bd9-1100-46d3-8c65-fb160da0071f",
                "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
                "158c047a-c907-4556-b7ef-446551a6b5f7",
                "966707d0-3269-4727-9be2-8c3a10f19b9d",
                "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
                "e8611ab8-c189-46e8-94e1-60213ab1f814"
            ],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": {
                "guestOrExternalUserTypes": "serviceProvider",
                "externalTenants": {
                    "@odata.type": "#microsoft.graph.conditionalAccessEnumeratedExternalTenants",
                    "membershipKind": "enumerated",
                    "members": [
                        "d1b209ea-0ffb-4ffe-b4dd-efac86a80e61",
                        "a2b18e84-31ca-4329-8784-783976e9373e"
                    ]
                }
            }
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#conditionalAccess/policies(\u002789165f74-e86d-4cc4-83d9-ffd98a98e0b7\u0027)/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    },
    "LocationInfo": [
        null,
        null
    ],
    "@odata.context": "https://graph.microsoft.com/beta/#identity/conditionalAccess/policies/",
    "@odata.type": "#microsoft.graph.conditionalAccessPolicy"
}