{"ETag":"W/\"datetime'2025-04-03T09%3A30%3A16.8661724Z'\"","PartitionKey":"CATemplate","RowKey":"0a481730-c2f9-424b-a054-26f32c962a49","Timestamp":"2025-04-03T09:30:16.8661724+00:00","JSON":"{\"id\":\"de99be63-6ccf-402d-9494-4cfb222e5ab5\",\"templateId\":\"a4072ac0-722b-4991-981b-7f9755daef14\",\"displayName\":\"Require multifactor authentication for guest access\",\"createdDateTime\":\"2025-01-07T09:38:43.595228Z\",\"modifiedDateTime\":\"2025-01-07T09:45:43.8506848Z\",\"state\":\"enabled\",\"conditions\":{\"userRiskLevels\":[],\"signInRiskLevels\":[],\"clientAppTypes\":[\"all\"],\"platforms\":null,\"locations\":null,\"times\":null,\"deviceStates\":null,\"devices\":null,\"clientApplications\":null,\"applications\":{\"includeApplications\":[\"All\"],\"excludeApplications\":[],\"includeUserActions\":[],\"includeAuthenticationContextClassReferences\":[],\"applicationFilter\":null},\"users\":{\"includeUsers\":[],\"excludeUsers\":[],\"includeGroups\":[],\"excludeGroups\":[],\"includeRoles\":[],\"excludeRoles\":[],\"excludeGuestsOrExternalUsers\":null,\"includeGuestsOrExternalUsers\":{\"guestOrExternalUserTypes\":\"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider\",\"externalTenants\":{\"@odata.type\":\"#microsoft.graph.conditionalAccessAllExternalTenants\",\"membershipKind\":\"all\"}}}},\"grantControls\":{\"operator\":\"OR\",\"builtInControls\":[\"mfa\"],\"customAuthenticationFactors\":[],\"termsOfUse\":[],\"authenticationStrength@odata.context\":\"https://graph.microsoft.com/beta/$metadata#conditionalAccess/policies('de99be63-6ccf-402d-9494-4cfb222e5ab5')/grantControls/authenticationStrength/$entity\",\"authenticationStrength\":null},\"LocationInfo\":[null,null]}","GUID":"0a481730-c2f9-424b-a054-26f32c962a49"}