{
    "id": "67001ecd-1695-4995-b9ba-50f26aa759c9",
    "templateId": "a3d0a415-b068-4326-9251-f9cdf9feeb64",
    "displayName": "Require multifactor authentication for all users",
    "createdDateTime": "2025-01-07T09:38:41.3303136Z",
    "modifiedDateTime": "2025-01-07T09:45:36.8635354Z",
    "state": "enabled",
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": [],
            "applicationFilter": null
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [
                "Mobit Admins"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": {
                "guestOrExternalUserTypes": "serviceProvider",
                "externalTenants": {
                    "@odata.type": "#microsoft.graph.conditionalAccessEnumeratedExternalTenants",
                    "membershipKind": "enumerated",
                    "members": [
                        "a2b18e84-31ca-4329-8784-783976e9373e",
                        "d1b209ea-0ffb-4ffe-b4dd-efac86a80e61"
                    ]
                }
            }
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#conditionalAccess/policies(\u002767001ecd-1695-4995-b9ba-50f26aa759c9\u0027)/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    },
    "LocationInfo": [
        null,
        null
    ],
    "@odata.context": "https://graph.microsoft.com/beta/#identity/conditionalAccess/policies/",
    "@odata.type": "#microsoft.graph.conditionalAccessPolicy"
}