{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
    "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
    "@odata.id": "identity/conditionalAccess/policies(\u002767001ecd-1695-4995-b9ba-50f26aa759c9\u0027)",
    "@odata.editLink": "identity/conditionalAccess/policies(\u002767001ecd-1695-4995-b9ba-50f26aa759c9\u0027)",
    "id": "67001ecd-1695-4995-b9ba-50f26aa759c9",
    "templateId": null,
    "displayName": "UPDATED Require multifactor authentication for all users",
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2024-05-24T09:27:59.650288Z",
    "modifiedDateTime@odata.type": "#DateTimeOffset",
    "modifiedDateTime": "2024-06-26T06:58:46.8310877Z",
    "state@odata.type": "#microsoft.graph.conditionalAccessPolicyState",
    "state": "enabled",
    "conditions": {
        "@odata.type": "#microsoft.graph.conditionalAccessConditionSet",
        "userRiskLevels@odata.type": "#Collection(microsoft.graph.riskLevel)",
        "userRiskLevels": [],
        "signInRiskLevels@odata.type": "#Collection(microsoft.graph.riskLevel)",
        "signInRiskLevels": [],
        "clientAppTypes@odata.type": "#Collection(microsoft.graph.conditionalAccessClientApp)",
        "clientAppTypes": [
            "all"
        ],
        "platforms": null,
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "@odata.type": "#microsoft.graph.conditionalAccessApplications",
            "includeApplications@odata.type": "#Collection(String)",
            "includeApplications": [
                "All"
            ],
            "excludeApplications@odata.type": "#Collection(String)",
            "excludeApplications": [],
            "includeUserActions@odata.type": "#Collection(String)",
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences@odata.type": "#Collection(String)",
            "includeAuthenticationContextClassReferences": [],
            "applicationFilter": null
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups@odata.type": "#Collection(String)",
            "excludeGroups": [
                "7e299d0e-e0e4-417e-944c-9e60522fe140"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": {
                "guestOrExternalUserTypes": "serviceProvider",
                "externalTenants": {
                    "@odata.type": "#microsoft.graph.conditionalAccessEnumeratedExternalTenants",
                    "membershipKind": "enumerated",
                    "members": [
                        "a2b18e84-31ca-4329-8784-783976e9373e",
                        "d1b209ea-0ffb-4ffe-b4dd-efac86a80e61"
                    ]
                }
            }
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#conditionalAccess/policies(\u002767001ecd-1695-4995-b9ba-50f26aa759c9\u0027)/grantControls/authenticationStrength/$entity",
        "authenticationStrength": null
    },
    "LocationInfo": [
        null,
        null
    ],
    "@odata.context": "https://graph.microsoft.com/beta/#identity/conditionalAccess/policies/",
    "@odata.type": "#microsoft.graph.conditionalAccessPolicy"
}